<style  type="text/css"> 
</style>

<b><center>
<span style="font-size: 24pt; line-height: 1.2">
COMS W4111-002, V02 (Spring 2022)<br>Introduction to Databases
</span>
</center></b>
<p>
<i><center>
<span style="font-size: 20pt; line-height: 1.2">
Homework 2: Programming and Non-Programming
</span>
    <br><br>
    Due Wednesday, February 23, 2022 at 11:59 PM
</center></i>

# Introduction

## Overview

This notebook has **2 sections that you must complete**:

1. Written questions testing knowledge of concepts. Answering these questions may require reviewing lecture slides, slides associated with the textbook, and/or online material. Both tracks complete this section.


2. Practical problems involving data modeling, relational algebra and SQL. Both tracks complete this section.


_We will separately release the track-specific Programming and Non-Programming parts of HW2._

## Submission

You will **submit 2 files** for this assignment.

1. Submit a zip file titled `<your_uni>_hw2_all.zip` to **HW2 All - Zip** on Gradescope.

    - Replace `<your_uni>` with your uni. My submission would be titled `dff9_hw2_all.zip`.
    - The zipped directory you submit should contain the following files:
        - `<your_uni>_hw2_all.ipynb` 
        - `Appearances.csv`
        - `Batting.csv`
        - `People.csv`
        - Any image files you choose to embed in your notebook.
    - All of these files, except the images you may embed in your notebook, are included in `s22_w4111_hw2_all.zip`, which you downloaded from Courseworks. You will have to rename the notebook file you downloaded to `<your_uni>_hw2_all.ipynb`, as discussed above.
        
        
2. Submit a PDF file titled `<your_uni>_hw2_all.pdf` to **HW2 All - PDF** on Gradescope.

    - This should be a PDF of your completed HW2 All Python notebook.
    - **Tag pages for each problem**. Per course policy, any untagged submission will receive an automatic 0. 
    - Double check your submission on Gradescope to ensure that the PDF conversion worked and that your pages are appropriately tagged.

## Collaboration and Information

- Answering some of the questions may require independent research to find information. We encourage you to try troubleshooting problems independently before reaching out for help.


- You may use any information you get in TA or Prof. Ferguson's office hours, from lectures or from recitations. This includes slides related to the recommended textbook.


- You may use information that you find on the web.


- You are NOT allowed to collaborate with other students outside of office hours.

# Written Questions

## Question 1: NULL

__Briefly__ explain Codd's 3rd Rule.
- What are some interpretations of a NULL value?
- An alternative to using NULL is some other value for indicating missing data, e.g. using -1 for the value of a weight column. Explain the benefits of NULL relative to other approaches.

<u>Answer:</u>

- Null is different from a zero value in that it can be interpreted as the value is unknown, the value is not available, or the value does not fit in the attribute. 
- Using the value of NULL will not affect the value of some derived attibute. For example, when calculating the average, using NULL will not be taken into account, whereas a -1 will be counted. Also, using NULL does not require much space comparing to other values for some datatypes.

## Question 2: Keys

__Briefly__ explain the following concepts:

- Primary Key
- Candidate Key
- Super Key
- Alternate Key
- Composite Key
- Unique Key
- Foreign Key

<u>Answer:</u>

- Primary Key: PK is the one candidate key that is selected by the administrator to uniquely identify tuples in a table. 
- Candidate Key: Candidate keys are unique and non-null for all tuples. They are single or multiple keys that can uniquely identify each row, and they are also super keys but with no repeated attributes. 
- Super Key:  Super key is a single key or a group of multiple keys that can uniquely identify tuples in a table. 
- Alternate Key: Alternate keys are candidate keys that are not the primary key. 
- Composite Key: Composite key is a candidate key or primary key that consists of more than one attribute.
- Unique Key: Unique key means that all values in the column should be different. 
- Foreign Key: Foreign key is the attribute that is the primary key of another table but is included in another host table.

## Question 3: Algebra

__Briefly__ explain what it means for the relational algebra to be _closed_ under the operations in the algebra. What is an important benefit?

<u>Answer:</u>

Both operands and the output of relational algebra are relations,  so output from one operation can become input to
another operation. An important benefit of this is that we can write nested-algebra using this property.

## Question 4: Equivalent Queries

__Briefly__ explain the concept of equivalent queries. Use the concept to explain how it is possible to derive the JOIN operation from other operations (SELECT, PROJECT).

<u>Answer:</u>

Equivalent queries are different queries that perform the same, i.e. getting the same result in the same data base. For example, courses ⨝ takes is equivalent with σ course.course_id = teaches.course_id (course ⨯ teaches).

## Question 5: More General Attribute Types

The relational model places restrictions on attributes. Many data scenarios have more complex types of attributes. __Briefly__ explain the following types of attributes:

- Simple attribute
- Composite attribute
- Derived attribute
- Single-value attribute
- Multi-value attribute

<u>Answer:</u>

- Simple attribute: simple attribute are atomic values such as a person's first name. 
- Composite attribute: Composite attributes are made of many simple attributes. For example, full name is a composite attribute that made up by first name and last name. 
- Derived attribute: Derived attributes are the attributes that themselves not in the database, but can be derived by other attributes in the database. For example, average_grade can be derived from a person's grades in all subjects. 
- Single-value attribute: Single-value attributes only contain single values, such as SSN. 
- Multi-value attribute: Multi-value attributes can contain multiple values. For example, a person can have multiple phone numbers.

# Practical Problems

## Setup

- Modify the cells below to setup your environment.


- The change should just be setting the DB user ID and password, replacing my user ID and password with yours for MySQL.

In [1]:
database_user_id = "root"
database_pwd = "dvuserdvuser"

In [2]:
database_url = "mysql+pymysql://" + \
    database_user_id + ":" + database_pwd + "@localhost"
database_url

'mysql+pymysql://root:dvuserdvuser@localhost'

In [3]:
%reload_ext sql

In [4]:
%sql $database_url

'Connected: root@None'

In [5]:
from sqlalchemy import create_engine

In [6]:
sqla_engine = create_engine(database_url)

In [7]:
#
# We are going to create a schema and some tables for the HW.
#
%sql create schema if not exists S22_W4111_HW2
%sql select 1;

 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.

[(1,)]

## Question 6: Manipulating String and Types

### Setup

- Run the following code cells.


- These cells create a table ```people_info``` and loads the table with a bunch of input strings.

In [8]:
input_string = [
    "Towny,Cavet,tcavet0@blinklist.com,1/9/1971,+62 (340) 387-5141",
    "Port,Gaylor,pgaylor1@blogger.com,3/15/1939,+86 (517) 758-9970",
    "Georgetta,Haddon,ghaddon2@symantec.com,9/19/1997,+81 (356) 753-5556",
    "Wylma,Lanney,wlanney3@list-manage.com,2/21/2018,+385 (853) 541-7347",
    "Mignonne,Georgeson,mgeorgeson4@123-reg.co.uk,8/7/1991,+63 (834) 397-5285",
    "Cchaddie,Cossins,ccossins5@chronoengine.com,3/12/1911,+242 (313) 943-4080",
    "Andie,Matyushonok,amatyushonok6@ask.com,4/24/1907,+380 (410) 464-9093",
    "Skippie,Zuenelli,szuenelli7@merriam-webster.com,3/22/2014,+7 (279) 484-2088",
    "Averyl,Barajas,abarajas8@fastcompany.com,6/19/1996,+232 (962) 344-7325",
    "Olia,Habens,ohabens9@quantcast.com,2/28/1922,+98 (935) 300-9359"
]

In [9]:
import pandas

In [10]:
df = pandas.DataFrame(input_string)

In [11]:
df.to_sql(
    "people_info", con=sqla_engine, if_exists="replace", index=False,
    schema="S22_W4111_HW2")

In [12]:
%sql use S22_W4111_HW2
%sql select 1;

 * mysql+pymysql://root:***@localhost
0 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.

[(1,)]

- Test loading the data.

In [13]:
%sql select * from people_info

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('Towny,Cavet,tcavet0@blinklist.com,1/9/1971,+62 (340) 387-5141',),
 ('Port,Gaylor,pgaylor1@blogger.com,3/15/1939,+86 (517) 758-9970',),
 ('Georgetta,Haddon,ghaddon2@symantec.com,9/19/1997,+81 (356) 753-5556',),
 ('Wylma,Lanney,wlanney3@list-manage.com,2/21/2018,+385 (853) 541-7347',),
 ('Mignonne,Georgeson,mgeorgeson4@123-reg.co.uk,8/7/1991,+63 (834) 397-5285',),
 ('Cchaddie,Cossins,ccossins5@chronoengine.com,3/12/1911,+242 (313) 943-4080',),
 ('Andie,Matyushonok,amatyushonok6@ask.com,4/24/1907,+380 (410) 464-9093',),
 ('Skippie,Zuenelli,szuenelli7@merriam-webster.com,3/22/2014,+7 (279) 484-2088',),
 ('Averyl,Barajas,abarajas8@fastcompany.com,6/19/1996,+232 (962) 344-7325',),
 ('Olia,Habens,ohabens9@quantcast.com,2/28/1922,+98 (935) 300-9359',)]

- Can we describe what the table looks like?

In [14]:
%sql describe people_info;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('0', 'text', 'YES', '', None, '')]

### Tasks

- The created table has one column ```0```. The values are strings with data separated by ```,```. The fields in the string are (in order):
    - ```first_name```
    - ```last_name```
    - ```email```
    - ```date_of_birth```
    - ```telephone_no```, which is of the form ```+CC (XXX)-XXX-XXXX``` where ```CC``` is the country code and the remainder is the number.
    
    
- You must process and cleanup the data using __ONLY__ SQL statements. The cleanup tasks include:
    - Creating a new table ```people_info_clean``` with a structure that better represents the data, e.g. columns, column data types, etc.
    - Converting each string and its subfields into the rows of ```people_info_clean```.
    
    
- You may use as many DDL and DML SQL statements as you need.


- Execute your statements in the cells below and show the output of the execution.


- The last two cells show show the data and schema for the information.

In [15]:
%%sql
drop table if exists people_info_clean;

create table people_info_clean
(
    first_name    varchar(64) null,
    last_name     varchar(64) null,
    email         varchar(128) null,
    date_of_birth date,
    telephone_no  varchar(32) null,
    tmp varchar(128) 
);

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.

[]

In [16]:
%%sql

insert into people_info_clean(tmp)
    select `0` from people_info;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[]

In [17]:
%%sql

update people_info_clean
    set first_name = substr(tmp, 1, locate(',', tmp)-1), tmp = substr(tmp, locate(',', tmp)+1);
    
update people_info_clean
    set last_name = substr(tmp, 1, locate(',', tmp)-1), tmp = substr(tmp, locate(',', tmp)+1);
    
update people_info_clean
    set email = substr(tmp, 1, locate(',', tmp)-1), tmp = substr(tmp, locate(',', tmp)+1);

update people_info_clean
    set date_of_birth = (select str_to_date(substr(tmp, 1, locate(',', tmp)-1) , "%c/%e/%Y")), 
    tmp = substr(tmp, locate(',', tmp)+1);

update people_info_clean
    set telephone_no = tmp ;

 * mysql+pymysql://root:***@localhost
10 rows affected.
10 rows affected.
10 rows affected.
10 rows affected.
10 rows affected.

[]

In [18]:
%%sql
    
alter table people_info_clean
    drop tmp;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [19]:
#
# Show the data.
#
%sql select * from people_info_clean

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('Towny', 'Cavet', 'tcavet0@blinklist.com', datetime.date(1971, 1, 9), '+62 (340) 387-5141'),
 ('Port', 'Gaylor', 'pgaylor1@blogger.com', datetime.date(1939, 3, 15), '+86 (517) 758-9970'),
 ('Georgetta', 'Haddon', 'ghaddon2@symantec.com', datetime.date(1997, 9, 19), '+81 (356) 753-5556'),
 ('Wylma', 'Lanney', 'wlanney3@list-manage.com', datetime.date(2018, 2, 21), '+385 (853) 541-7347'),
 ('Mignonne', 'Georgeson', 'mgeorgeson4@123-reg.co.uk', datetime.date(1991, 8, 7), '+63 (834) 397-5285'),
 ('Cchaddie', 'Cossins', 'ccossins5@chronoengine.com', datetime.date(1911, 3, 12), '+242 (313) 943-4080'),
 ('Andie', 'Matyushonok', 'amatyushonok6@ask.com', datetime.date(1907, 4, 24), '+380 (410) 464-9093'),
 ('Skippie', 'Zuenelli', 'szuenelli7@merriam-webster.com', datetime.date(2014, 3, 22), '+7 (279) 484-2088'),
 ('Averyl', 'Barajas', 'abarajas8@fastcompany.com', datetime.date(1996, 6, 19), '+232 (962) 344-7325'),
 ('Olia', 'Habens', 'ohabens9@quantcast.com', datetime.date(1922, 2, 28), '+98 (935) 300-9359')]

In [20]:
#
# Show the schema (architecture and structure).
#
%sql describe people_info_clean;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[('first_name', 'varchar(64)', 'YES', '', None, ''),
 ('last_name', 'varchar(64)', 'YES', '', None, ''),
 ('email', 'varchar(128)', 'YES', '', None, ''),
 ('date_of_birth', 'date', 'YES', '', None, ''),
 ('telephone_no', 'varchar(32)', 'YES', '', None, '')]

## Question 7: Intermediate SQL and Data Processing

### Task 1: Load Data

- Continue to use the schema you created - ```S22_W4111_HW2```.


- There are three files in the homework folder:
    - ```People.csv```
    - ```Appearances.csv```
    - ```Batting.csv```
    
    
- Use one of the approaches we have previously used directly in notebooks to load the CSV files into the schema above. 
    - You __may not__ use external tools like DataGrip.
    - Some examples of techniques are in HW 1 and in the Pandas examples.
    
    
- Put your code in the cells provided below. The final cells, which you must run after loading the CSV files, simply display some information.

In [22]:
# Your code
import pandas as pd
project_root = "/Users/litinghuang/Desktop/Database/HW/lh3119_hw2_all"
people_df = pd.read_csv(project_root + "/People.csv")
appearance_df = pd.read_csv(project_root + "/Appearances.csv")
batting_df = pd.read_csv(project_root + "/Batting.csv")

In [23]:

people_df.to_sql(
    "people", con=sqla_engine, if_exists="replace", index=False,
    schema="S22_W4111_HW2")

appearance_df.to_sql(
    "appearances", con=sqla_engine, if_exists="replace", index=False,
    schema="S22_W4111_HW2")

batting_df.to_sql(
    "batting", con=sqla_engine, if_exists="replace", index=False,
    schema="S22_W4111_HW2")

In [24]:
%sql select * from people limit 10;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('aardsda01', 1981.0, 12.0, 27.0, 'USA', 'CO', 'Denver', None, None, None, None, None, None, 'David', 'Aardsma', 'David Allan', 215.0, 75.0, 'R', 'R', '2004-04-06', '2015-08-23', 'aardd001', 'aardsda01'),
 ('aaronha01', 1934.0, 2.0, 5.0, 'USA', 'AL', 'Mobile', 2021.0, 1.0, 22.0, 'USA', 'GA', 'Atlanta', 'Hank', 'Aaron', 'Henry Louis', 180.0, 72.0, 'R', 'R', '1954-04-13', '1976-10-03', 'aaroh101', 'aaronha01'),
 ('aaronto01', 1939.0, 8.0, 5.0, 'USA', 'AL', 'Mobile', 1984.0, 8.0, 16.0, 'USA', 'GA', 'Atlanta', 'Tommie', 'Aaron', 'Tommie Lee', 190.0, 75.0, 'R', 'R', '1962-04-10', '1971-09-26', 'aarot101', 'aaronto01'),
 ('aasedo01', 1954.0, 9.0, 8.0, 'USA', 'CA', 'Orange', None, None, None, None, None, None, 'Don', 'Aase', 'Donald William', 190.0, 75.0, 'R', 'R', '1977-07-26', '1990-10-03', 'aased001', 'aasedo01'),
 ('abadan01', 1972.0, 8.0, 25.0, 'USA', 'FL', 'Palm Beach', None, None, None, None, None, None, 'Andy', 'Abad', 'Fausto Andres', 184.0, 73.0, 'L', 'L', '2001-09-10', '2006-04-13', 'abada001', 'abadan01'),
 ('abadfe01', 1985.0, 12.0, 17.0, 'D.R.', 'La Romana', 'La Romana', None, None, None, None, None, None, 'Fernando', 'Abad', 'Fernando Antonio', 235.0, 74.0, 'L', 'L', '2010-07-28', '2021-10-01', 'abadf001', 'abadfe01'),
 ('abadijo01', 1850.0, 11.0, 4.0, 'USA', 'PA', 'Philadelphia', 1905.0, 5.0, 17.0, 'USA', 'NJ', 'Pemberton', 'John', 'Abadie', 'John W.', 192.0, 72.0, 'R', 'R', '1875-04-26', '1875-06-10', 'abadj101', 'abadijo01'),
 ('abbated01', 1877.0, 4.0, 15.0, 'USA', 'PA', 'Latrobe', 1957.0, 1.0, 6.0, 'USA', 'FL', 'Fort Lauderdale', 'Ed', 'Abbaticchio', 'Edward James', 170.0, 71.0, 'R', 'R', '1897-09-04', '1910-09-15', 'abbae101', 'abbated01'),
 ('abbeybe01', 1869.0, 11.0, 11.0, 'USA', 'VT', 'Essex', 1962.0, 6.0, 11.0, 'USA', 'VT', 'Colchester', 'Bert', 'Abbey', 'Bert Wood', 175.0, 71.0, 'R', 'R', '1892-06-14', '1896-09-23', 'abbeb101', 'abbeybe01'),
 ('abbeych01', 1866.0, 10.0, 14.0, 'USA', 'NE', 'Falls City', 1926.0, 4.0, 27.0, 'USA', 'CA', 'San Francisco', 'Charlie', 'Abbey', 'Charles S.', 169.0, 68.0, 'L', 'L', '1893-08-16', '1897-08-19', 'abbec101', 'abbeych01')]

In [25]:
%sql select * from appearances limit 10;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(1871, 'TRO', None, 'abercda01', 1, 1.0, 1, 1.0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0.0, 0.0, 0.0),
 (1871, 'RC1', None, 'addybo01', 25, 25.0, 25, 25.0, 0, 0, 0, 22, 0, 3, 0, 0, 0, 0, 0.0, 0.0, 0.0),
 (1871, 'CL1', None, 'allisar01', 29, 29.0, 29, 29.0, 0, 0, 0, 2, 0, 0, 0, 29, 0, 29, 0.0, 0.0, 0.0),
 (1871, 'WS3', None, 'allisdo01', 27, 27.0, 27, 27.0, 0, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0.0, 0.0, 0.0),
 (1871, 'RC1', None, 'ansonca01', 25, 25.0, 25, 25.0, 0, 5, 1, 2, 20, 0, 1, 0, 0, 1, 0.0, 0.0, 0.0),
 (1871, 'FW1', None, 'armstbo01', 12, 12.0, 12, 12.0, 0, 0, 0, 0, 0, 0, 0, 11, 1, 12, 0.0, 0.0, 0.0),
 (1871, 'RC1', None, 'barkeal01', 1, 1.0, 1, 1.0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0.0, 0.0, 0.0),
 (1871, 'BS1', None, 'barnero01', 31, 31.0, 31, 31.0, 0, 0, 0, 16, 0, 15, 0, 0, 0, 0, 0.0, 0.0, 0.0),
 (1871, 'FW1', None, 'barrebi01', 1, 1.0, 1, 1.0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0.0, 0.0, 0.0),
 (1871, 'BS1', None, 'barrofr01', 18, 17.0, 18, 18.0, 0, 0, 0, 1, 0, 0, 13, 0, 4, 17, 0.0, 0.0, 0.0)]

In [26]:
%sql select * from batting limit 10;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('abercda01', 1871, 1, 'TRO', None, 1, 4, 0, 0, 0, 0, 0, 0.0, 0.0, 0.0, 0, 0.0, None, None, None, None, 0.0),
 ('addybo01', 1871, 1, 'RC1', None, 25, 118, 30, 32, 6, 0, 0, 13.0, 8.0, 1.0, 4, 0.0, None, None, None, None, 0.0),
 ('allisar01', 1871, 1, 'CL1', None, 29, 137, 28, 40, 4, 5, 0, 19.0, 3.0, 1.0, 2, 5.0, None, None, None, None, 1.0),
 ('allisdo01', 1871, 1, 'WS3', None, 27, 133, 28, 44, 10, 2, 2, 27.0, 1.0, 1.0, 0, 2.0, None, None, None, None, 0.0),
 ('ansonca01', 1871, 1, 'RC1', None, 25, 120, 29, 39, 11, 3, 0, 16.0, 6.0, 2.0, 2, 1.0, None, None, None, None, 0.0),
 ('armstbo01', 1871, 1, 'FW1', None, 12, 49, 9, 11, 2, 1, 0, 5.0, 0.0, 1.0, 0, 1.0, None, None, None, None, 0.0),
 ('barkeal01', 1871, 1, 'RC1', None, 1, 4, 0, 1, 0, 0, 0, 2.0, 0.0, 0.0, 1, 0.0, None, None, None, None, 0.0),
 ('barnero01', 1871, 1, 'BS1', None, 31, 157, 66, 63, 10, 9, 0, 34.0, 11.0, 6.0, 13, 1.0, None, None, None, None, 1.0),
 ('barrebi01', 1871, 1, 'FW1', None, 1, 5, 1, 1, 1, 0, 0, 1.0, 0.0, 0.0, 0, 0.0, None, None, None, None, 0.0),
 ('barrofr01', 1871, 1, 'BS1', None, 18, 86, 13, 13, 2, 1, 0, 11.0, 1.0, 0.0, 0, 0.0, None, None, None, None, 0.0)]

In [27]:
%sql describe people;

 * mysql+pymysql://root:***@localhost
24 rows affected.

[('playerID', 'text', 'YES', '', None, ''),
 ('birthYear', 'double', 'YES', '', None, ''),
 ('birthMonth', 'double', 'YES', '', None, ''),
 ('birthDay', 'double', 'YES', '', None, ''),
 ('birthCountry', 'text', 'YES', '', None, ''),
 ('birthState', 'text', 'YES', '', None, ''),
 ('birthCity', 'text', 'YES', '', None, ''),
 ('deathYear', 'double', 'YES', '', None, ''),
 ('deathMonth', 'double', 'YES', '', None, ''),
 ('deathDay', 'double', 'YES', '', None, ''),
 ('deathCountry', 'text', 'YES', '', None, ''),
 ('deathState', 'text', 'YES', '', None, ''),
 ('deathCity', 'text', 'YES', '', None, ''),
 ('nameFirst', 'text', 'YES', '', None, ''),
 ('nameLast', 'text', 'YES', '', None, ''),
 ('nameGiven', 'text', 'YES', '', None, ''),
 ('weight', 'double', 'YES', '', None, ''),
 ('height', 'double', 'YES', '', None, ''),
 ('bats', 'text', 'YES', '', None, ''),
 ('throws', 'text', 'YES', '', None, ''),
 ('debut', 'text', 'YES', '', None, ''),
 ('finalGame', 'text', 'YES', '', None, ''),
 ('retroID', 'text', 'YES', '', None, ''),
 ('bbrefID', 'text', 'YES', '', None, '')]

In [28]:
%sql describe appearances;

 * mysql+pymysql://root:***@localhost
21 rows affected.

[('yearID', 'bigint', 'YES', '', None, ''),
 ('teamID', 'text', 'YES', '', None, ''),
 ('lgID', 'text', 'YES', '', None, ''),
 ('playerID', 'text', 'YES', '', None, ''),
 ('G_all', 'bigint', 'YES', '', None, ''),
 ('GS', 'double', 'YES', '', None, ''),
 ('G_batting', 'bigint', 'YES', '', None, ''),
 ('G_defense', 'double', 'YES', '', None, ''),
 ('G_p', 'bigint', 'YES', '', None, ''),
 ('G_c', 'bigint', 'YES', '', None, ''),
 ('G_1b', 'bigint', 'YES', '', None, ''),
 ('G_2b', 'bigint', 'YES', '', None, ''),
 ('G_3b', 'bigint', 'YES', '', None, ''),
 ('G_ss', 'bigint', 'YES', '', None, ''),
 ('G_lf', 'bigint', 'YES', '', None, ''),
 ('G_cf', 'bigint', 'YES', '', None, ''),
 ('G_rf', 'bigint', 'YES', '', None, ''),
 ('G_of', 'bigint', 'YES', '', None, ''),
 ('G_dh', 'double', 'YES', '', None, ''),
 ('G_ph', 'double', 'YES', '', None, ''),
 ('G_pr', 'double', 'YES', '', None, '')]

In [29]:
%sql describe batting;

 * mysql+pymysql://root:***@localhost
22 rows affected.

[('playerID', 'text', 'YES', '', None, ''),
 ('yearID', 'bigint', 'YES', '', None, ''),
 ('stint', 'bigint', 'YES', '', None, ''),
 ('teamID', 'text', 'YES', '', None, ''),
 ('lgID', 'text', 'YES', '', None, ''),
 ('G', 'bigint', 'YES', '', None, ''),
 ('AB', 'bigint', 'YES', '', None, ''),
 ('R', 'bigint', 'YES', '', None, ''),
 ('H', 'bigint', 'YES', '', None, ''),
 ('2B', 'bigint', 'YES', '', None, ''),
 ('3B', 'bigint', 'YES', '', None, ''),
 ('HR', 'bigint', 'YES', '', None, ''),
 ('RBI', 'double', 'YES', '', None, ''),
 ('SB', 'double', 'YES', '', None, ''),
 ('CS', 'double', 'YES', '', None, ''),
 ('BB', 'bigint', 'YES', '', None, ''),
 ('SO', 'double', 'YES', '', None, ''),
 ('IBB', 'double', 'YES', '', None, ''),
 ('HBP', 'double', 'YES', '', None, ''),
 ('SH', 'double', 'YES', '', None, ''),
 ('SF', 'double', 'YES', '', None, ''),
 ('GIDP', 'double', 'YES', '', None, '')]

### Task 2: Complicated Queries

__Note:__ Performing the query in this task may require changing column values or types.

#### Query - Career Summary

- Write a query that produces a result of the form:
    - ```playerID```
    - ```nameLast```
    - ```nameFirst```
    - The sum of ```appearances.G_all``` for the player over all rows.
    - The sum over all rows of the following columns from batting:
        - ```G```
        - ```AB```
        - ```R```
        - ```AB```
        - ```2B```
        - ```3B```
        - ```HR```
        - ```RBI```
        - ```BB```
  
    - ```batting_average```, which is defined as $
\dfrac{sum(H)}{sum(AB)}
$

    - ```on_base_percentage```, which is defined as $
\dfrac{(sum(H) + sum(BB))}{(sum(AB) + sum(BB))}
$


- The query should be limited to 20 rows, and sorted by ```on_base_percentage``` from highest to lowest.


- ```batting_average``` and ```on_base_percentage``` should round to three decimal places.

In [31]:
%%sql

with people_basic as 
(
    select playerID, nameLast, nameFirst from people
),
appearances_career as 
(
    select playerID, sum(G_all) as total_g from appearances group by playerID
),
basic_appearances as 
(
    select * from people_basic join appearances_career using (playerID)
),
statistics as 
(
    select playerID, sum(G) as sum_g, 
        sum(AB) as sum_ab, 
        sum(R) as sum_r, 
        sum(2B) as sum_2b, 
        sum(3B) as sum_3b, 
        sum(HR) as sum_hr, 
        sum(RBI) as sum_rbi, 
        sum(BB) as sum_bb,
        round(sum(h)/if (sum(ab) = 0, NULL, sum(ab)),3) as batting_average,
        round(((sum(h) + sum(BB))/ if(sum(AB)+sum(BB) = 0, NULL, sum(AB)+sum(BB))),3) as on_base_percentage
    from batting group by playerID
),
career_summary as 
(
    select * from basic_appearances join statistics using (playerID)
)



select * from career_summary order by on_base_percentage desc limit 20;

 * mysql+pymysql://root:***@localhost
20 rows affected.

[('torrejo02', 'Torres', 'Jose', Decimal('66'), Decimal('66'), Decimal('1'), Decimal('1'), Decimal('0'), Decimal('0'), Decimal('0'), 0.0, Decimal('0'), Decimal('1.000'), Decimal('1.000')),
 ('meansjo01', 'Means', 'John', Decimal('42'), Decimal('42'), Decimal('1'), Decimal('0'), Decimal('0'), Decimal('0'), Decimal('0'), 0.0, Decimal('1'), Decimal('1.000'), Decimal('1.000')),
 ('sotogr01', 'Soto', 'Gregory', Decimal('60'), Decimal('60'), Decimal('2'), Decimal('0'), Decimal('0'), Decimal('0'), Decimal('0'), 0.0, Decimal('0'), Decimal('1.000'), Decimal('1.000')),
 ('alanirj01', 'Alaniz', 'R. J.', Decimal('12'), Decimal('12'), Decimal('1'), Decimal('0'), Decimal('0'), Decimal('0'), Decimal('0'), 1.0, Decimal('0'), Decimal('1.000'), Decimal('1.000')),
 ('carsoro01', 'Carson', 'Robert', Decimal('31'), Decimal('31'), Decimal('0'), Decimal('1'), Decimal('0'), Decimal('0'), Decimal('0'), 0.0, Decimal('1'), None, Decimal('1.000')),
 ('horstje01', 'Horst', 'Jeremy', Decimal('72'), Decimal('72'), Decimal('1'), Decimal('0'), Decimal('0'), Decimal('0'), Decimal('0'), 1.0, Decimal('0'), Decimal('1.000'), Decimal('1.000')),
 ('thompaa01', 'Thompson', 'Aaron', Decimal('52'), Decimal('52'), Decimal('0'), Decimal('0'), Decimal('0'), Decimal('0'), Decimal('0'), 0.0, Decimal('1'), None, Decimal('1.000')),
 ('alberan01', 'Albers', 'Andrew', Decimal('26'), Decimal('26'), Decimal('1'), Decimal('0'), Decimal('0'), Decimal('0'), Decimal('0'), 1.0, Decimal('0'), Decimal('1.000'), Decimal('1.000')),
 ('meekev01', 'Meek', 'Evan', Decimal('179'), Decimal('179'), Decimal('1'), Decimal('0'), Decimal('0'), Decimal('0'), Decimal('0'), 0.0, Decimal('0'), Decimal('1.000'), Decimal('1.000')),
 ('melanma01', 'Melancon', 'Mark', Decimal('606'), Decimal('606'), Decimal('0'), Decimal('0'), Decimal('0'), Decimal('0'), Decimal('0'), 0.0, Decimal('1'), None, Decimal('1.000')),
 ('hoovejj01', 'Hoover', 'J. J.', Decimal('290'), Decimal('290'), Decimal('0'), Decimal('1'), Decimal('0'), Decimal('0'), Decimal('0'), 0.0, Decimal('1'), None, Decimal('1.000')),
 ('schlibr01', 'Schlitter', 'Brian', Decimal('84'), Decimal('84'), Decimal('1'), Decimal('0'), Decimal('0'), Decimal('0'), Decimal('0'), 0.0, Decimal('0'), Decimal('1.000'), Decimal('1.000')),
 ('tupmama01', 'Tupman', 'Matt', Decimal('1'), Decimal('1'), Decimal('1'), Decimal('0'), Decimal('0'), Decimal('0'), Decimal('0'), 0.0, Decimal('0'), Decimal('1.000'), Decimal('1.000')),
 ('montgst01', 'Montgomery', 'Steve', Decimal('72'), Decimal('72'), Decimal('1'), Decimal('1'), Decimal('0'), Decimal('0'), Decimal('0'), 0.0, Decimal('0'), Decimal('1.000'), Decimal('1.000')),
 ('hancory01', 'Hancock', 'Ryan', Decimal('11'), Decimal('11'), Decimal('1'), Decimal('1'), Decimal('0'), Decimal('0'), Decimal('0'), 0.0, Decimal('0'), Decimal('1.000'), Decimal('1.000')),
 ('cammaer01', 'Cammack', 'Eric', Decimal('8'), Decimal('8'), Decimal('1'), Decimal('0'), Decimal('0'), Decimal('1'), Decimal('0'), 1.0, Decimal('0'), Decimal('1.000'), Decimal('1.000')),
 ('parrajo01', 'Parra', 'Jose', Decimal('82'), Decimal('82'), Decimal('0'), Decimal('0'), Decimal('0'), Decimal('0'), Decimal('0'), 0.0, Decimal('2'), None, Decimal('1.000')),
 ('duvalmi01', 'Duvall', 'Mike', Decimal('53'), Decimal('53'), Decimal('0'), Decimal('0'), Decimal('0'), Decimal('0'), Decimal('0'), 0.0, Decimal('1'), None, Decimal('1.000')),
 ('yanes01', 'Yan', 'Esteban', Decimal('472'), Decimal('472'), Decimal('2'), Decimal('1'), Decimal('0'), Decimal('0'), Decimal('1'), 1.0, Decimal('0'), Decimal('1.000'), Decimal('1.000')),
 ('bruneju01', 'Brunette', 'Justin', Decimal('4'), Decimal('4'), Decimal('1'), Decimal('0'), Decimal('0'), Decimal('0'), Decimal('0'), 0.0, Decimal('0'), Decimal('1.000'), Decimal('1.000'))]

## Question 8: "Fun" with Sets


- ```People``` represents basic information about people associated with Major League Baseball.


- ```Appearances``` contains information about people who appeared (played in) MLB games.


- There are some entries in the ```People``` table that do not appear in ```Appearances```.


- Using a __subquery__, write a query that counts the number of people in the ```People``` table who do not have an entry in ```Appearances```.


- Run your query below. Note, your query will be __SLOW.__

In [32]:
%%sql
with diff as 
(
    select playerID from people where playerID not in (select playerID from appearances)
)
select count(playerID) from diff;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(460,)]

- Just for the heck of it, run the scripts below and repeat your query. Also, the changes I am making are a good hint on how to solve the problem.

In [33]:
%%sql

use s22_w4111_hw2;

drop table if exists people_fast;
drop table if exists appearances_fast;

create table people_fast as select * from people;
create table appearances_fast as select * from appearances;

ALTER TABLE `appearances_fast` 
CHANGE COLUMN `playerID` `playerID` VARCHAR(16) NULL DEFAULT NULL ,
ADD INDEX `playerID_idx` (playerID) VISIBLE;

ALTER TABLE `people_fast` 
CHANGE COLUMN `playerID` `playerID` VARCHAR(16) NULL DEFAULT NULL ,
ADD INDEX `peopleID_idx` (playerID) VISIBLE;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.
20358 rows affected.
108717 rows affected.
108717 rows affected.
20358 rows affected.

[]

- Run your query here.

In [34]:
%%sql
with difference as 
(
    select playerID from people_fast where playerID not in (select playerID from appearances_fast)

)
select count(playerID) from difference;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(460,)]

## Question 9: Don Plays Baseball

- I always wanted to play baseball for the Boston Red Sox, and also play with Ted Williams.


- Ted Williams' ```playerID``` is ```willite01```.


- My ```playerID``` would be ```fergusdo```.


- Perform the following tasks using SQL:
    - Insert an entry in ```people``` with:
        - ```playerID``` = ```fergusdo```
        - ```nameLast``` = ```Ferguson```
        - ```nameFirst``` = ```Donald```
    - Existence without Ted Williams is meaningless. So, using an Update statement, update the entry in people for ```fergusdo``` to have the same ```birthYear```, ```birthMonth``` and ```birthDay``` as Ted Williams.
    
    
- Run a query showing the row in ```people``` for ```fergusdo```.


- Delete the row you added.

In [35]:
# Insert statement
#
%sql insert into people (playerID, nameLast, nameFirst) values ("fergusdo", "Ferguson", "Donald");

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

In [36]:
%%sql
update people t1, people t2
    set t1.birthYear = t2.birthYear, t1.birthMonth = t2.birthMonth, t1.birthDay = t2.birthDay
    where t1.playerID = "fergusdo" and t2.playerID = "willite01"

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

In [37]:
# Select statement showing row.
#
%sql select * from people where playerID = "fergusdo";

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('fergusdo', 1918.0, 8.0, 30.0, None, None, None, None, None, None, None, None, None, 'Donald', 'Ferguson', None, None, None, None, None, None, None, None, None)]

In [38]:
# Delete the created row.
#
%sql delete from people where playerID = "fergusdo"

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

## Question 10: There is No Question 10

- You all get a free point for putting up with me.